; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-2-2-12)
(:domain gripper-strips)
(:objects robot1 robot2 - robot
rgripper1 lgripper1 rgripper2 lgripper2 - gripper
room1 room2 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 - object)
(:init
(at-robby robot1 room1)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room2)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at ball1 room2)
(at ball2 room2)
(at ball3 room2)
(at ball4 room2)
(at ball5 room1)
(at ball6 room2)
(at ball7 room2)
(at ball8 room1)
(at ball9 room1)
(at ball10 room2)
(at ball11 room2)
(at ball12 room2)
)
(:goal
(and
(at ball1 room1)
(at ball2 room2)
(at ball3 room1)
(at ball4 room2)
(at ball5 room2)
(at ball6 room2)
(at ball7 room1)
(at ball8 room2)
(at ball9 room1)
(at ball10 room1)
(at ball11 room1)
(at ball12 room1)
)
)
)

; plan
1. (pick robot2 ball10 room2 lgripper2)
   deleted: (at ball10 room2) (free robot2 lgripper2)
   added: (carry robot2 ball10 lgripper2)
   goals met: 4 of 12
2. (pick robot2 ball7 room2 rgripper2)
   deleted: (at ball7 room2) (free robot2 rgripper2)
   added: (carry robot2 ball7 rgripper2)
   goals met: 4 of 12
3. (pick robot1 ball5 room1 lgripper1)
   deleted: (at ball5 room1) (free robot1 lgripper1)
   added: (carry robot1 ball5 lgripper1)
   goals met: 4 of 12
4. (pick robot1 ball8 room1 rgripper1)
   deleted: (at ball8 room1) (free robot1 rgripper1)
   added: (carry robot1 ball8 rgripper1)
   goals met: 4 of 12
5. (move robot1 room1 room2)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room2)
   goals met: 4 of 12
6. (drop robot1 ball5 room2 lgripper1)
   deleted: (carry robot1 ball5 lgripper1)
   added: (at ball5 room2) (free robot1 lgripper1)
   goals met: 5 of 12
7. (pick robot1 ball1 room2 lgripper1)
   deleted: (at ball1 room2) (free robot1 lgripper1)
   added: (carry robot1 ball1 lgripper1)
   goals met: 5 of 12
8. (drop robot1 ball8 room2 rgripper1)
   deleted: (carry robot1 ball8 rgripper1)
   added: (at ball8 room2) (free robot1 rgripper1)
   goals met: 6 of 12
9. (pick robot1 ball3 room2 rgripper1)
   deleted: (at ball3 room2) (free robot1 rgripper1)
   added: (carry robot1 ball3 rgripper1)
   goals met: 6 of 12
10. (move robot2 room2 room1)
   deleted: (at-robby robot2 room2)
   added: (at-robby robot2 room1)
   goals met: 6 of 12
11. (drop robot2 ball10 room1 lgripper2)
   deleted: (carry robot2 ball10 lgripper2)
   added: (at ball10 room1) (free robot2 lgripper2)
   goals met: 7 of 12
12. (drop robot2 ball7 room1 rgripper2)
   deleted: (carry robot2 ball7 rgripper2)
   added: (at ball7 room1) (free robot2 rgripper2)
   goals met: 8 of 12
13. (move robot1 room2 room1)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room1)
   goals met: 8 of 12
14. (drop robot1 ball1 room1 lgripper1)
   deleted: (carry robot1 ball1 lgripper1)
   added: (at ball1 room1) (free robot1 lgripper1)
   goals met: 9 of 12
15. (drop robot1 ball3 room1 rgripper1)
   deleted: (carry robot1 ball3 rgripper1)
   added: (at ball3 room1) (free robot1 rgripper1)
   goals met: 10 of 12
16. (move robot1 room1 room2)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room2)
   goals met: 10 of 12
17. (pick robot1 ball11 room2 lgripper1)
   deleted: (at ball11 room2) (free robot1 lgripper1)
   added: (carry robot1 ball11 lgripper1)
   goals met: 10 of 12
18. (pick robot1 ball12 room2 rgripper1)
   deleted: (at ball12 room2) (free robot1 rgripper1)
   added: (carry robot1 ball12 rgripper1)
   goals met: 10 of 12
19. (move robot1 room2 room1)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room1)
   goals met: 10 of 12
20. (drop robot1 ball11 room1 lgripper1)
   deleted: (carry robot1 ball11 lgripper1)
   added: (at ball11 room1) (free robot1 lgripper1)
   goals met: 11 of 12
21. (drop robot1 ball12 room1 rgripper1)
   deleted: (carry robot1 ball12 rgripper1)
   added: (at ball12 room1) (free robot1 rgripper1)
   goals met: 12 of 12
